import React from "react";
import styled from "styled-components";
import colors from "../../styles/colors";

const Wrapper = styled.div`
  color: ${colors.deepGray};
`;

const Terms = () => {
    return <>
        <Wrapper>
            <h1>이용약관</h1><br/>
            <p style={{textAlign: 'right'}}>(2021년 01월 25일 제정)</p>

            <h3>제1조 (목적)</h3>
            이 약관은 힐링타임즈 (이하 “회사”라 한다)가 제공하는 힐링타임즈 온라인 서비스의 이용과 관련하여 “회사”와 구매회원과의
            권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.<br/>
            <br/>
            <h3>제2조 (정의)</h3>
            이 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br/>
            1. “ 힐링타임즈 온라인 서비스”이하 “서비스”라 한다)라 함은 “회사”가 판매채널을 통해서 제공하는 전자 상거래 관련
            서비스를 말합니다.<br/>
            2. “판매채널”이라 함은 “회사”가 상품 또는 용역(이하 “상품 등”이라 한다)을 “회원”에게 판매할 수 있도록 마련한
            “회사” 또는 제3자의 웹사이트와 모바일 어플리케이션을 말합니다.<br/>
            3. “회원”이라 함은 이 약관에 따라 “회사”와 이용계약을 체결하여 “회사”가 제공하는 “서비스”를 이용하는 자를
            말합니다.<br/>
            4. 이 약관에 사용되는 용어 중 본 조에서 정하지 않은 부분은 관계법령 및 일반관례에 따릅니다.<br/>
            제3조 (약관 등의 명시와 설명 및 개정)<br/>
            ① “회사”는 이 약관의 내용, 상호, 대표자 성명, 전화번호, 팩스번호, 사업자등록번호, 통신판매업 신고번호, 고객센터
            등을 “회원”이 쉽게 알 수 있도록 판매채널 내 서비스 화면에 순차적으로 게시합니다. 다만, 대표자성명, 팩스번호,
            사업자등록번호 및 이 약관은 “회원”이 판매채널 내 서비스에 연결된 화면을 통하여 볼 수 있도록 할 수 있습니다.<br/>
            ② “회사”는 “회원”이 약관에 동의하기에 앞서 약관에 정하여져 있는 내용 중 청약철회, 배송책임, 환불조건 등과 같은
            중요한 내용을 “회원”이 쉽게 이해할 수 있도록 별도의 연결화면 또는 팝업화면 등을 제공합니다.<br/>
            ③ “회사”는 “전자상거래등에서의 소비자보호에 관한 법률”, “약관의 규제에 관한 법률”, “정보통신망 이용촉진 및
            정보보호 등에 관한 법률”, “소비자보호법” 등 관계법령을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.<br/>
            ④ “회사”가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행약관과 함께 “회사”가 운영하는 웹사이트 내의
            적절한 장소에 개정약관의 적용일자 7일 전부터 적용일자 전일까지 공지합니다. 다만, “회원”에게 불리한 약관의 개정의
            경우에는 최소한 30일 이상의 유예기간을 두고 공지합니다. 이 경우 “회사”는 개정전 내용과 개정후 내용을 명확히 비교하여
            이용자가 알기 쉽도록 표시합니다.<br/>
            ⑤ “회사”가 전항에 따라 개정약관을 공지 또는 통지하면서 “회원”에게 약관 변경 적용일까지 거부의사를 표시하지 아니할
            경우, 약관의 변경에 동의한 것으로 간주한다는 뜻을 명확하게 공지 또는 통지하였음에도 “회원”이 명시적으로 거부의
            의사표시를 하지 아니한 경우 “회원”이 개정약관에 동의한 것으로 봅니다.<br/>
            ⑥ “회원”이 개정약관의 적용에 동의하지 않는 경우 “회사”는 개정 약관의 내용을 적용할 수 없으며, 이 경우 “회원”은
            이용계약을 해지할 수 있습니다. 다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우 “회사”는 이용계약을 해지할
            수 있습니다.<br/>
            <br/>
            <h3>제4조 (약관의 해석)</h3>
            이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 “정보통신망 이용촉진 및 정보보호에 관한 법률”,
            “전자상거래등에서의 소비자보호에 관한 법률”, “약관의 규제에 관한 법률”, 기타 관계법령, 개별 판매채널의 이용약관 또는
            상관례에 따릅니다.<br/>
            <br/>
            <h3>제5조 (서비스의 제공 및 변경)</h3>
            ① “회사”는 다음과 같은 업무를 수행합니다.<br/>
            1. 상품 등에 대한 정보 제공 및 구매 계약의 체결<br/>
            2. 구매 계약이 체결된 상품 등의 배송<br/>
            3. 기타 “회사”가 정하는 업무<br/>
            ② “회사”는 상품 등의 품절 또는 기술적 사양의 변경 등의 경우에는 장차 체결되는 계약에 의해 제공 할 상품 등의 내용을
            변경할 수 있습니다. 이 경우에는 변경된 상품 등의 내용 및 제공일자를 명시하여 현재의 상품 등의 내용을 게시한 곳에 즉시
            공지합니다.<br/>
            ③ “회사”가 “회원”과 계약을 체결한 서비스의 내용을 상품 등의 품절 또는 기술적 사양의 변경 등의 사유로 변경할
            경우에는 그 사유를 “회원”에게 통지 가능한 수단으로 즉시 통지합니다.<br/>
            ④ 전항의 경우 “회사”는 이로 인하여 “회원”이 입은 인과관계가 입증된 실제 손해를 배상합니다. 다만, “회사”가 고의
            또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.<br/>
            <br/>
            <h3>제6조 (서비스의 중단)</h3>
            ① “회사”는 서비스 제공을 위한 정보통신설비의 보수점검, 교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는
            서비스의 제공을 일시적으로 중단할 수 있습니다.<br/>
            ② “회사”는 제1항의 사유로 서비스의 제공이 일시적으로 중단됨으로 인하여 “회원” 또는 제3자가 입은 손해에 대하여
            배상합니다. 다만, “회사”의 고의 또는 과실이 없는 경우에는 그러하지 아니합니다.<br/>
            ③ 사업 종목의 전환, 사업의 포기, 업체간의 통합 등의 이유로 서비스를 제공할 수 없게 되는 경우 “회사”는 제9조에
            정한 방법으로 “회원”에게 통지하고 당초 “회사”에서 제시한 조건에 따라 “회원”에게 보상합니다.<br/>
            <br/>
            <h3>제7조 (회원가입)</h3>
            ① “회원”으로 가입하고자 하는 자는 “회사”가 정한 절차에 따라 이 약관과 개인정보의 수집, 제공 및 활용 동의서에
            동의함으로써 “회원” 가입을 신청합니다.<br/>
            ② “회사”는 제1항과 같이 “회원”으로 가입할 것을 신청한 이용자 중 다음 각호에 해당하지 않는 한 “회원”으로
            등록합니다.<br/>
            1. 가입 신청자가 이 약관 제8조 제2항 내지 제3항에 의하여 이전에 “회원” 가입을 상실한 적이 있는 경우. 다만,
            “회원” 자격 상실 후 3년이 경과한 자로서 “회사”의 “회원” 재가입 승낙을 얻은 자는 예외로 한다.<br/>
            2. 등록 내용에 허위, 기재 누락, 오기가 있는 경우<br/>
            3. 기타 “회원”으로 등록하는 것이 “회사”의 기술상 현저히 지장이 있다고 판단되는 경우<br/>
            4. “회원” 가입 신청일 현재 만14세 이하의 아동인 경우<br/>
            ③ “회원” 가입 계약의 성립 시기는 “회사”의 승낙이 “회원”에게 도달한 시점으로 합니다.<br/>
            ④ “회원”은 가입시 “회사”에 제공한 정보에 변경이 있는 경우 즉시 전자우편 기타 방법으로 “회사”에 대하여 그 변경
            사항을 알려야 합니다.<br/>
            <br/>
            <h3>제8조 (회원 탈퇴 및 자격 정지 등)</h3>
            ① “회원”은 “회사”에 언제든지 서비스 탈퇴를 요청할 수 있으며, “회사”는 즉시 “회원” 탈퇴를 처리합니다. 다만,
            탈퇴 처리시점에 “회원”이 구매 중인 상품 등이 있는 경우 “회사”는 해당 상품 등의 구매가 완료된 후 탈퇴
            처리합니다.<br/>
            ② “회원”이 다음 각호의 사유에 해당하는 경우 “회사”는 “회원” 자격을 제한 및 정지시킬 수 있습니다.<br/>
            1. 가입 신청시에 허위 내용을 등록한 경우<br/>
            2. “회사”를 이용하여 구입한 상품 등의 대금, 기타 서비스 이용과 관련하여 “회원”이 부담하는 채무를 기일에 지급하지
            않는 경우<br/>
            3. 다른 사람의 서비스 이용을 방해하거나 정보를 도용하는 등 전자상거래 질서를 위협하는 경우<br/>
            4. 서비스를 이용함에 있어서 법령 또는 이 약관이 금지하거나 공서 양속에 반하는 행위를 하는 경우<br/>
            5. 서비스에 음란물을 게재하거나 음란사이트를 링크시키는 경우<br/>
            6. 기타 “회사”의 정상적인 영업활동 및 서비스 운영을 고의로 방해하는 행위를 하는 경우<br/>
            ③ “회사”가 “회원” 자격을 제한, 정지 시킨 후, 동일한 행위가 2회 이상 반복되거나 30일 이내에 그 사유가 시정되지
            아니하는 경우 “회사”는 “회원”의 자격을 상실시킬 수 있습니다.<br/>
            ④ “회사”가 “회원” 자격을 상실시키는 경우에는 “회원” 등록을 말소합니다. 이 경우 “회원”에게 이를 통지하고,
            “회원” 등록 말소 전에 최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.<br/>
            <br/>
            <h3>제9조 (회원에 대한 통지)</h3>
            ① “회사”가 “회원”에 대한 통지를 하는 경우 이 약관에 별도 규정이 없는 한 “회원”이 제공한 전자우편, 서비스 내
            전자쪽지 등으로 할 수 있습니다.<br/>
            ② “회사”는 “회원” 전체에 대한 통지의 경우 7일 이상 “회사”가 운영하는 웹사이트 내의 게시판에 게시함으로써 제1항의
            통지에 갈음할 수 있습니다. 다만, “회원” 본인의 거래와 관련하여 중대한 영향을 미치는 사항에 대하여는 제1항의 통지를
            합니다.<br/>
            ③ “회사”는 “회원”의 연락처 미기재, 변경 후 미수정 등으로 인하여 개별 통지가 어려운 경우에 한하여 전항의 공지를
            함으로써 개별 통지를 한 것으로 간주합니다.<br/>
            <br/>
            <h3>제10조 (구매신청)</h3>
            “회원”은 판매채널에서 다음 또는 이와 유사한 방법에 의하여 구매를 신청하며, “회사”는 “회원”이 구매를 신청함에 있어서
            다음의 각 내용을 알기 쉽게 제공하여야 합니다.<br/>
            1. 상품 등의 확인 및 선택<br/>
            2. 결제방법의 선택 및 결제정보의 입력<br/>
            3. 상품 등의 구매 신청 및 이에 관한 확인 또는 “회사”의 확인에 대한 동의<br/>
            <br/>
            <h3>제11조 (계약의 성립)</h3>
            ① “회사”는 제10조와 같은 구매 신청에 대하여 다음 각호에 해당하면 승낙하지 않을 수 있다.<br/>
            1. 신청 내용에 허위, 기재 누락, 오기가 있는 경우<br/>
            2. 미성년자가 담배, 주류 등 청소년보호법에서 금지하는 상품 등을 구매하는 경우<br/>
            3. 상행위(재판매)를 목적으로 구매하는 거래이거나, 거래 정황상 상행위(재판매)를 목적으로 한 구매로 판단되는
            경우<br/>
            4. 구매 신청을 승낙하는 것이 “회사”의 기술상 현저히 지장이 있다고 판단되는 경우<br/>
            5. 기타 “회원”의 귀책사유로 승인이 불가능하다고 판단되는 경우<br/>
            ② “회원”의 구매계약 성립시기는 “회사”가 구매완료를 구매절차 상에서 표시한 시점으로 합니다.<br/>
            <br/>
            <h3>제12조 (결제수단)</h3>
            ① 서비스에서 구매한 상품 등에 대한 대금 결제 수단은 다음 각호의 방법 중 가용한 방법으로 할 수 있습니다. 다만,
            “회사”는 “회원”의 지급방법에 대하여 어떠한 명목의 수수료도 추가하여 징수하지 않습니다.<br/>
            1. 선불카드, 직불카드, 신용카드 등의 각종 카드결제<br/>
            2. 전화 또는 휴대전화를 이용한 결제<br/>
            3. 폰뱅킹, 인터넷뱅킹, 메일뱅킹, 온라인 무통장 입금 등의 각종 계좌이체<br/>
            4. 카카오포인트 등 “회사”가 지급한 적립금에 의한 결제<br/>
            5. “회사”와 계약을 맺었거나 “회사”가 인정한 상품권에 의한 결제<br/>
            6. 캐시백, 신용카드 등의 포인트에 의한 결제<br/>
            7. 기타 전자적 결제 수단에 의한 대금지급 등<br/>
            ② “회원”은 상품 등의 구매 시 제1항의 결제 수단을 사용함에 있어 반드시 본인 명의의 결제 수단을 사용하여야 하며,
            타인의 결제 수단을 임의로 사용하여서는 안됩니다. 타인의 결제 수단을 임의 사용함으로써 발생하는 “회사”, 결제 수단의
            적법한 소유자, 결제 관련 제3자의 손실과 손해에 대한 책임은 “회원”에게 있습니다.<br/>
            ③ 상품 등의 구매대금의 결제와 관련하여 “회원”이 입력한 정보 및 그 정보와 관련하여 발생한 책임과 불이익은 “회원”이
            부담하여야 합니다.<br/>
            ④ “회원”은 구매대금 결제시 정당하고, 적법한 사용권한을 가지고 있는 결제 수단을 사용하여야 하며, “회사”는 그 여부를
            확인할 수 있습니다. 또한 “회사”는 “회원” 결제 수단의 적법성 등에 대한 확인이 완료될 때까지 거래진행을 중지하거나
            해당 거래를 취소할 수 있습니다.<br/>
            ⑤ “회사”의 정책 및 제1항의 결제업체(이동통신사, 카드사 등)의 기준에 따라 “회원”의 당월 누적 결제액이 제한될 수
            있습니다. 해당 기준을 초과한 경우 상품 등의 구매가 불가능할 수 있습니다.<br/>
            <br/>
            <h3>제13조 (상품 등의 공급)</h3>
            ① “회사”는 “회원”과 상품 등의 공급에 관하여 별도의 약정이 없는 이상, “회원”이 청약을 한 날부터 신속하게 상품
            등을 배송할 수 있도록 주문제작, 포장 등 기타의 필요한 조치를 취합니다.<br/>
            ② 제1항에도 불구하고 “회원”과 “회사”간 상품 등의 공급 시기에 관하여 별도의 약정이 있는 경우에는 그에 따릅니다.
            이때 “회사”는 “회원”이 상품 등의 공급 절차 및 진행 사항을 확인할 수 있도록 적절한 조치를 합니다.<br/>
            ③ “회사”는 “회원”이 구매한 상품 등에 대해 배송 수단, 수단별 배송 비용 부담자, 수단별 배송 기간 등을 명시합니다.
            만약, “회사”가 약정 배송 기간을 초과한 경우에는 그로 인한 “회원”의 손해를 배상하여야 합니다. 다만, “회사”가
            고의, 과실이 없음을 입증한 경우에는 그러하지 아니합니다.<br/>
            <br/>
            <h3>제14조 (환급)</h3>
            ① “회사”는 “회원”이 구매 신청한 상품 등이 품절 등의 사유로 인도 또는 제공을 할 수 없을 때에는 지체 없이 그
            사유를 이용자에게 통지하고 사전에 상품 등의 대금을 받은 경우에는 대금을 받은 날부터 3영업일 이내에 환급하거나 환급에
            필요한 조치를 취합니다.<br/>
            <br/>
            <h3>제15조 (청약철회 등)</h3>
            ① “회사”와 상품 등의 구매에 관한 계약을 체결한 “회원”은 계약 내용에 관한 서면을 교부 받은 날 또는 수신 확인의
            통지를 받은 날로부터 7일 이내에 청약의 철회를 할 수 있습니다. 다만, 그 서면을 교부 또는 수신확인의 통지를 받은
            때보다 상품 등의 공급이 늦게 이루어진 경우에는 상품 등의 공급을 받거나 공급이 개시된 날부터 7일 이내에 청약의 철회를
            할 수 있습니다.<br/>
            ② “회원”은 상품 등을 배송 받은 경우 다음 각호의 1에 해당하는 경우에는 반품 및 교환을 할 수 없습니다.<br/>
            1. “회원”에게 책임 있는 사유로 상품 등이 멸실 또는 훼손된 경우(다만, 상품 등의 내용을 확인하기 위해여 포장 등을
            훼손한 경우에는 청약 철회를 할 수 있습니다.)<br/>
            2. “회원”의 사용 또는 일부 소비에 의하여 상품 등의 가치가 현저히 감소한 경우<br/>
            3. 시간의 경과에 의하여 재판매가 곤란할 정도로 상품 등의 가치가 현저히 감소한 경우<br/>
            4. 같은 성능을 지닌 상품 등으로 복제가 가능한 경우 그 원본인 상품 등의 포장을 훼손한 경우<br/>
            5. 그 밖에 거래의 안전을 위하여 대통령령이 정하는 경우<br/>
            ③ 제2항 제2호 내지 제4호의 경우에는 “회사”가 사전에 청약 철회 등이 제한되는 사실을 “회원”이 쉽게 알 수 있는
            곳에 명기하거나 시용 상품을 제공하는 등의 조치를 하지 않았다면 “회원”의 청약 철회 등이 제한되지 않습니다.<br/>
            ④ “회원”은 제1항 및 제2항의 규정에도 불구하고 상품 등의 내용이 표시, 광고 내용과 다르거나 계약 내용과 다르게
            이행된 때에는 당해 상품 등을 공급 받은 날부터 3월 이내, 그 사실을 안 날 또는 알 수 있었던 날부터 30일 이내에
            청약 철회 등을 할 수 있습니다.<br/>
            <br/>
            <h3>제16조 (청약철회 등의 효과)</h3>
            ① “회사”는 “회원”으로부터 상품 등을 반환 받은 경우 3영업일 이내에 이미 지급받은 상품 등의 대금을 환급합니다. 이
            경우 “회사”가 “회원”에게 상품 등의 환급을 지연한 때에는 그 지연 기간에 대하여 전자상거래 등에서의 소비자보호에 관한
            법률 시행령이 정하는 지연 이자율을 곱하여 산정한 지연 이자(이하 “지연 배상금”이라 한다)를 지급합니다.<br/>
            ② “회사”는 위 대금을 환급함에 있어서 “회원”이 신용카드 그 밖에 대통령령이 정하는 결제 수단으로 상품 등의 대금을
            지급한 때에는 지체 없이 당해 결제 수단을 제공한 사업자로 하여금 상품 등의 대금 청구를 정지 또는 취소하도록 요청합니다.<br/>
            ③ 청약철회 등의 경우 공급 받은 상품 등의 반환에 필요한 비용은 “회원”이 부담합니다. “회사”는 “회원”에게 청약 철회
            등을 이유로 위약금 또는 손해배상을 청구하지 않습니다. 다만, 상품 등의 내용이 표시, 광고 내용과 다르거나 계약 내용과
            다르게 이행되어 청약철회 등을 하는 경우 상품 등의 반환에 필요한 비용은 “회사”가 부담합니다.<br/>
            ④ 이미 상품 등이 일부 사용 또는 일부 소비된 경우에는 해당 상품 등의 사용 또는 일부 사용에 의하여 “회원”이 얻은
            이익 또는 해당 상품 등의 공급에 소요된 비용에 상당하는 금액으로서 대통령령이 정하는 범위의 금액의 지급을 “회원”에게
            청구할 수 있습니다.<br/>
            ⑤ “회원”이 상품 등을 제공 받을 때 발송비를 부담한 경우에 “회사”는 청약 철회시 그 비용을 누가 부담하는지를 알기
            쉽도록 명확하게 표시합니다.<br/>
            <br/>
            <h3>제17조 (쿠폰)</h3>
            ① “회사”는 “회원”이 서비스를 통하여 상품 등을 구매하는 경우, “회사”의 정책에 따라 “회원”에게 일정액 또는
            일정비율을 할인 받을 수 있는 쿠폰을 부여할 수 있습니다.<br/>
            ② “회사”는 품목, 거래금액 등에 따라 쿠폰의 사용을 제한할 수 있습니다.<br/>
            ③ 쿠폰의 부여 및 사용에 관한 상세한 사항은 “회사”가 정한 정책에 따르며, “회사”는 판매채널 또는 “회사”가 운영하는
            웹사이트 등을 통하여 이를 “회원”에게 안내합니다.<br/>
            ④ “회원”은 쿠폰을 명시된 사용 기간 내만 사용할 수 있습니다.<br/>
            ⑤ “회원”은 쿠폰을 본인의 거래에 대해서만 사용할 수 있으며, 어떠한 경우라도 쿠폰을 타인에게 매매 또는 양도하거나,
            실질적으로 매매 또는 양도와 동일하게 볼 수 있는 행위를 할 수 없습니다.<br/>
            ⑥ “회원”이 부당 또는 부정하게 쿠폰을 취득한 경우 “회원”은 쿠폰을 사용할 수 없으며, “회사”는 이를 회수할 수
            있습니다.<br/>
            <br/>
            <h3>제18조 (회사의 의무)</h3>
            ① “회사”는 법령과 이 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 이 약관이 정하는 바에 따라 지속적이고,
            안정적으로 상품 등을 제공하는데 최선을 다하여야 합니다.<br/>
            ② “회사”는 “회원”이 안전하게 인터넷 서비스를 이용할 수 있도록 개인정보(신용정보 포함) 보호를 위한 보안 시스템을
            갖추며, 개인정보취급방침을 공지하고 이를 준수합니다.<br/>
            ③ “회사”는 상품 등에 대하여 표시·광고의 공정화에 관한 법률 제3조 소정의 부당한 표시, 광고 행위를 함으로써 이용자가
            손해를 입은 때에는 이를 배상할 책임을 집니다.<br/>
            ④ “회사”는 “회원”이 원하지 않는 영리 목적의 광고성 전자우편을 발송하지 않습니다.<br/>
            ⑤ “회사”는 서비스 이용과 관련하여 “회원”으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를 처리하여야
            합니다. “회원”이 제기한 의견이나 불만사항에 대해서는 “회원”에게 처리과정 및 결과를 전달합니다.<br/>
            <br/>
            <h3>제19조 (회원의 의무)</h3>
            ① “회원”은 상품을 구매하기 전에 반드시 “회사”가 제공하는 상품 등의 상세 내용과 거래의 조건을 정확하게 확인한 후
            구매를 신청하여야 합니다. 구매하려는 상품 등의 상세내용과 거래의 조건을 확인하지 않고 구매하여 발생하는 손해에 대하여
            “회원”이 책임을 부담합니다.<br/>
            ② “회원”은 이 약관 및 “회사”가 서비스와 관련하여 고지하는 내용을 준수하여야 하며, 약관 및 고지내용을 위반하거나
            이행하지 아니하여 발생하는 손해에 대하여 책임을 부담합니다.<br/>
            ③ “회원”은 “회사”가 서비스를 안전하게 제공할 수 있도록 “회사”에 협조하여야 하며, “회사”가 “회원”의 이 약관
            위반행위를 발견하여 “회원”에게 해당 위반행위에 대하여 소명을 요청할 경우 “회원”은 “회사”의 요청에 적극 응하여야
            합니다.<br/>
            ④ 미성년자인 “회원”이 서비스를 이용하여 상품 등을 구매시 법정대리인이 해당 계약에 대하여 동의를 하여야 정상적인 상품
            등의 구매계약이 체결될 수 있습니다. 만약, 미성년자인 “회원”이 법정대리인의 동의 없이 상품을 구매하는 경우 본인 또는
            법정대리인이 이를 취소할 수 있습니다.<br/>
            ⑤ “회원”이 서비스를 통해 상품 등을 주문한 후 5영업일(토요일, 공휴일 제외) 이내에 구매대금을 지급하지 않거나,
            구매대금의 지급 완료일로부터 7일 이내에 배송지 주소 등의 정보를 제공하지 않을 경우 주문취소로 간주되며, 해당 주문은
            자동 취소처리 됩니다.<br/>
            <br/>
            <h3>제20조 (회원의 금지행위)</h3>
            ① “회원”은 다음 각호의 행위를 하여서는 안됩니다.<br/>
            1. “회사”가 제공하는 서비스 이용방법에 의하지 아니하고 비정상적인 방법으로 서비스를 이용하거나 시스템에 접근하는
            행위<br/>
            2. 타인의 명의, 카드정보, 계좌정보 등을 도용하여 “회사”가 제공하는 서비스를 이용하는 행위<br/>
            3. “회사”가 정하지 않은 비정상적인 방법으로 카카오포인트, 쿠폰 등을 취득하거나 사용하는 행위<br/>
            4. “회사”가 게시하는 정보의 무단, 변경 또는 “회사”가 정한 정보 이외의 정보(컴퓨터프로그램 등) 등을 송신 또는
            게시하는 행위<br/>
            5. “회사” 및 기타 제3자의 저작권 등 지적재산권에 대한 침해행위<br/>
            6. “회사” 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위<br/>
            7. 외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 판매채널에 공개 또는 게시하는 행위<br/>
            8. 불법 할인의 목적으로 “모바일 교환권”을 구매하여 제3자에게 판매하는 행위<br/>
            9. 구매의사 없이 반복적인 구매행위를 하는 행위<br/>
            10. 기타 불법적이거나 부당한 행위<br/>
            ② “회사”는 “회원”이 본 조의 금지행위를 행하는 경우 서비스의 일부 또는 전부를 이용정지하거나 서비스 이용계약을 임의로
            해지할 수 있으며, 이 경우 발생하는 손해에 대한 책임은 “회원”이 부담합니다. “회사”는 필요한 경우 “회원”의 금지행위
            사실을 관련 정부기관 또는 사법기관에 통지할 수 있습니다.<br/>
            <br/>
            <h3>제21조 (저작권의 귀속 및 이용 제한)</h3>
            ① “회사”가 작성한 저작물에 대한 저작권 기타 지적재산권은 “회사”에 귀속합니다.<br/>
            ② “회원”은 서비스를 이용함으로써 얻은 정보 중 “회사”에게 지적재산권이 귀속된 정보를 “회사”의 사전 승낙 없이 복제,
            송신, 출판, 배포, 방송 기타 방법에 의하여 영리 목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.<br/>
            <br/>
            <h3>제22조 (책임제한)</h3>
            ① “회사”는 천재지변 또는 이에 준하는 불가항력으로 인한 서비스를 제공할 수 없는 경우에는 관련한 책임이
            면제됩니다.<br/>
            ② “회사”는 “회원”의 귀책사유로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다.<br/>
            <br/>
            <h3>제23조 (분쟁 해결)</h3>
            ① “회사”는 “회원”이 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상 처리하기 위하여 피해 보상 처리 기구인
            고객만족센터를 설치·운영합니다.<br/>
            ② “회사”는 “회원”으로부터 제출되는 불만 사항 및 의견은 우선적으로 그 사항을 처리합니다. 다만, 신속한 처리가 곤란한
            경우에는 “회원”에게 그 사유와 처리 일정을 즉시 통보해 드립니다.<br/>
            ③ “회사”와 “회원”간에 발생한 전자상거래 분쟁과 관련하여 “회원”의 피해 구제 신청이 있는 경우에는 공정거래위원회 또는
            시도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.<br/>
            <br/>
            <h3>제24조 (준거법 및 재판관할)</h3>
            ① 이 약관과 관련된 사항에 대하여는 대한민국법을 준거법으로 합니다.<br/>
            ② “회사”와 “회원”간에 발생한 분쟁에 관한 소송은 민사소송법 상의 관할법원에 제기합니다.<br/>
            <br/>
            <h3>부칙</h3>
            이 약관은 2021년 01월25일부터 적용됩니다.<br/>
            공지일자 : 2021년 01월 25일<br/>
            적용일자 : 2021년 01월 25일<br/><br/><br/>
        </Wrapper>
        <div>
            <h1>개인정보 취급방침</h1><br/>
            힐링타임즈 (이하 “회사”라고 함)는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법, 통신비밀보호법,
            전기통신사업법 등 정보통신서비스제공자가 준수하여야 할 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에 의거한
            개인정보취급방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.<br/>
            본 개인정보취급방침은 회사에서 제공하는 서비스에 적용되며 다음과 같은 내용을 담고 있습니다.<br/>
            <h4>1. 수집하는 개인정보의 항목 및 수집방법</h4>
            <h4>2. 개인정보의 수집 및 이용목적</h4>
            <h4>3. 개인정보 제공</h4>
            <h4>4. 개인정보의 보유 및 이용기간</h4>
            <h4>5. 개인정보 파기절차 및 방법</h4>
            <h4>6. 이용자 및 법정대리인의 권리와 그 행사방법</h4>
            <h4>7. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항</h4>
            <h4>8. 개인정보의 기술적/관리적 보호 대책</h4>
            <h4>9. 개인정보관리책임자 및 담당자의 연락처</h4>
            <h4>10. 고지의 의무</h4>
            <br/>
            <br/>
            <h3>1. 수집하는 개인정보의 항목 및 수집방법</h3>
            A. 수집하는 개인정보의 항목<br/>
            첫째, 회사는 회원(또는 서비스) 가입, 원활한 고객상담, 각종 서비스의 제공 등을 위해 아래와 같은 최소한의 개인정보를
            필수항목으로 수집하고 있습니다.<br/>
            힐링타임즈 아이디(이메일 주소)<br/>
            • 필수항목 : 이메일, 성명, 전화번호, 생활지역, SNS주소<br/>
            <br/>
            <br/>
            둘째, 서비스 이용과정이나 서비스 제공 업무 처리 과정에서 아래와 같은 정보들이 자동으로 생성되거나 추가로 수집될 수
            있습니다.<br/>
            • IP Address, 쿠키, 접속로그, 방문 일시, 서비스 이용 기록, 불량 이용 기록<br/>
            <br/>
            B. 개인정보 수집방법<br/>
            회사는 다음과 같은 방법으로 개인정보를 수집합니다.<br/>
            1. 홈페이지, 서면양식, 팩스, 전화, 상담 게시판, 이메일, 이벤트 응모, 배송요청<br/>
            2. 협력회사로부터의 제공<br/>
            3. 생성정보 수집 툴을 통한 수집<br/>
            <br/>
            <h3>2. 개인정보의 수집 및 이용목적</h3>
            A. 서비스 제공에 관한 계약 이행 및 서비스 제공에 따른 요금정산<br/>
            컨텐츠 제공, 특정 맞춤 서비스 제공, 물품배송 또는 청구서 등 발송, 본인인증, 구매 및 요금 결제, 요금추심<br/>
            <br/>
            B. 회원관리<br/>
            회원제 서비스 제공, 개인식별, 힐링타임즈 이용약관 위반 회원에 대한 이용제한 조치, 서비스의 원활한 운영에 지장을 미치는
            행위 및 서비스 부정이용 행위 제재, 가입의사 확인, 가입 및 가입횟수 제한, 만14세 미만 아동 개인정보 수집 시 법정
            대리인 동의여부 확인, 추후 법정 대리인 본인확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달,
            회원탈퇴 의사의 확인<br/>
            <br/>
            C. 신규 서비스 개발 및 마케팅·광고에의 활용<br/>
            신규 서비스 개발 및 맞춤 서비스 제공, 통계학적 특성에 따른 서비스 제공 및 광고 게재, 서비스의 유효성 확인, 이벤트
            정보 및 참여기회 제공, 광고성 정보 제공, 접속빈도 파악, 회원의 서비스이용에 대한 통계<br/>
            <br/>
            <h3>3. 개인정보 제공</h3>
            회사는 이용자들의 개인정보를 “2. 개인정보의 수집목적 및 이용목적”에서 고지한 범위내에서 사용하며, 이용자의 사전 동의
            없이는 동 범위를 초과하여 이용하거나 원칙적으로 이용자의 개인정보를 외부에 공개하지 않습니다. 다만, 아래의 경우에는
            예외로 합니다.<br/>
            1. 이용자들이 사전에 공개에 동의한 경우<br/>
            2. 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우<br/>
            <br/>
            <br/>
            <h3>4. 개인정보의 보유 및 이용기간</h3>
            이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 단, 다음의 정보에 대해서는
            아래의 이유로 명시한 기간 동안 보존합니다.<br/>
            A. 회사 내부 방침에 의한 정보보유 사유<br/>
            부정이용기록 (아이디, 성명, DI)<br/>
            • 보존 이유: 부정 가입 및 이용 방지 (※ ‘부정이용기록’이란 광고부정이용에 따라 운영 정책에 의해 회사로부터 이용
            제한 등을 당한 기록을 말합니다.)<br/>
            • 보존 기간: 6개월<br/>
            <br/>
            기업 등록 미승인(보류/거부) 시 등록정보<br/>
            • 보존 이유: 재등록 신청의 효율적 처리 및 악의적 재등록 신청 방지<br/>
            • 보존 기간: 등록신청일로부터 1년, 명시적인 등록거절시 의사를 표시한날로부터 30일<br/>
            <br/>
            탈퇴기록<br/>
            • 보존 이유: 민원처리 등<br/>
            • 보존 기간: 30일<br/>
            <br/>
            B. 관련법령에 의한 정보보유 사유<br/>
            상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서
            정한 일정한 기간 동안 회원정보를 보관합니다. 이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은
            아래의 예시와 같습니다.<br/>
            <br/>
            계약 또는 청약철회 등에 관한 기록<br/>
            • 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br/>
            • 보존 기간: 5년<br/>
            <br/>
            대금결제 및 재화 등의 공급에 관한 기록<br/>
            • 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br/>
            • 보존 기간: 5년<br/>
            <br/>
            소비자의 불만 또는 분쟁처리에 관한 기록<br/>
            • 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br/>
            • 보존 기간: 3년<br/>
            <br/>
            표시/광고에 관한 기록<br/>
            • 보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br/>
            • 보존 기간: 6개월<br/>
            <br/>
            세법이 규정하는 모든 거래에 관한 장부 및 증빙서류<br/>
            • 보존 이유: 국세기본법, 법인세법<br/>
            • 보존 기간: 5년<br/>
            <br/>
            전자금융 거래에 관한 기록<br/>
            • 보존 이유: 전자금융거래법<br/>
            • 보존 기간: 5년<br/>
            <br/>
            웹사이트 방문에 관한 기록<br/>
            • 보존 이유: 통신비밀보호법<br/>
            • 보존 기간: 3개월<br/>
            <br/>
            <br/>
            <h3>5. 개인정보 파기절차 및 방법</h3>
            이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다.<br/>
            회사의 개인정보 파기절차 및 방법은 다음과 같습니다.<br/>
            A. 파기절차<br/>
            • 이용자가 회원가입 등을 위해 입력한 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경 우 별도의 서류함) 내부
            방침 및 기타 관련 법령에 의한 정보보호 사유에 따라(보유 및 이용기간 참조)일정 기간 저장된 후 파기됩니다.<br/>
            • 동 개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.<br/>
            B. 파기방법<br/>
            • 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.<br/>
            • 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.<br/>
            <br/>
            <br/>
            <h3>6. 이용자 및 법정대리인의 권리와 그 행사방법</h3>
            1. 이용자 및 법정대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수
            있으며, 회사의 개인정보의 처리에 동의하지 않는 경우 동의를 거부하거나 가입해지(회원탈퇴)를 요청하실 수 있습니다. 다만,
            그러한 경우 서비스의 일부 또는 전부 이용이 어려울 수 있습니다.<br/>
            2. 이용자 혹은 만 14세 미만 아동의 개인정보에 대한 조회, 수정 또는 가입해지를 위해서 개인정보 관리책임자 혹은
            개인정보 관리담당자에게 서면, 전화 또는 이메일로 연락하시면 지체 없이 조치하겠습니다.<br/>
            3. 이용자가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지
            않습니다. 또한 잘못된 개인정보를 제3 자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이
            이루어지도록 하겠습니다.<br/>
            4. 회사는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 “5. 개인정보의 보유 및 이용기간”에
            명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.<br/>
            <br/>
            <br/>
            <h3>7. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항</h3>
            A. 쿠키<br/>
            • 회사는 개인화되고 맞춤화된 서비스를 제공하기 위해서 이용자의 정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를
            사용합니다.<br/>
            • 쿠키는 웹사이트를 운영하는데 이용되는 서버가 이용자의 브라우저에게 보내는 아주 작은 텍스트 파일로 이용자 컴퓨터의
            하드디스크에 저장됩니다. 이후 이 용자가 웹 사이트에 방문할 경우 웹 사이트 서버는 이용자의 하드 디스크에 저장되어 있는
            쿠키의 내용을 읽어 이용자의 환경설정을 유지하고 맞춤화된 서비스를 제공하기 위해 이용됩니다.<br/>
            • 쿠키는 개인을 식별하는 정보를 자동적/능동적으로 수집하지 않으며, 이용자는 언제든지 이러한 쿠키의 저장을 거부하거나
            삭제할 수 있습니다.<br/>
            <br/>
            B. 쿠키의 사용 목적<br/>
            • 이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서 이용자는 웹브라우저에서 옵션을 설정함으로써 모든 쿠키를
            허용하거나, 쿠키가 저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도 있습니다.<br/>
            • 다만, 쿠키의 저장을 거부할 경우에는 로그인이 필요한 회사의 일부 서비스는 이용에 어려움이 있을 수 있습니다.<br/>
            • 쿠키 설치 허용 여부를 지정하는 방법(Internet Explorer의 경우) 은 다음과 같습니다.<br/>
            ① [도구] 메뉴에서 [인터넷 옵션]을 선택합니다.<br/>
            ② [개인정보 탭]을 클릭합니다.<br/>
            ③ [개인정보취급 수준]을 설정하시면 됩니다.<br/>
            <br/>
            <h3>8. 개인정보의 기술적/관리적 보호 대책</h3>
            회사는 이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여
            다음과 같은 기술적/관리적 대책을 강구하고 있습니다.<br/>
            A. 비밀번호 암호화<br/>
            회원 아이디(ID)의 비밀번호는 암호화되어 저장 및 관리되고 있어 본인만이 알고 있으며, 개인정보의 확인 및 변경도
            비밀번호를 알고 있는 본인에 의해서만 가능합니다.<br/>
            B. 해킹 등에 대비한 대책<br/>
            회사는 해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고
            있습니다. <br/>
            개인정보의 훼손에 대비해서 자료를 수시로 백업하고 있고, 최신 백신프로그램을 이용하여 이용자들의 개인정보나 자료가
            누출되거나 손상되지 않도록 방지하고 있으며, 암호화통신 등을 통하여 네트워크상에서 개인정보를 안전하게 전송할 수 있도록
            하고 있습니다. <br/>
            그리고 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있으며, 기타 시스템적으로 보안성을 확보하기 위한 가능한
            모든 기술적 장치를 갖추려 노력하고 있습니다.<br/>
            C. 취급 직원의 최소화 및 교육<br/>
            회사의 개인정보관련 취급 직원은 담당자에 한정시키고 있고 이를 위한 별도의 비밀번호를 부여하여 정기적으로 갱신하고 있으며,
            담당자에 대한 수시 교육을 통하여 개인정보취급방침의 준수를 항상 강조하고 있습니다.<br/>
            D. 개인정보보호전담기구의 운영<br/>
            사내 개인정보보호전담기구 등을 통하여 개인정보취급방침의 이행사항 및 담당자의 준수여부를 확인하여 문제가 발견될 경우 즉시
            수정하고 바로 잡을 수 있도록 노력하고 있습니다.<br/>
            단, 회사가 개인정보보호 의무를 다 하였음에도 불구하고 이용자 본인의 부주의나 회사가 관리하지 않는 영역에서의 사고 등
            회사의 귀책에 기인하지 않은 손해에 대해서는 회사는 책임을 지지 않습니다.<br/>
            <br/>
            <br/>
            <h3>9. 개인정보관리책임자 및 담당자의 연락처</h3>
            <br/>
            귀하께서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 혹은 담당부서로 신고하실 수
            있습니다. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.<br/>
            개인정보 관리 책임자<br/>
            • 이름: 김진구<br/>
            • 직위: 대표<br/>
            • 전화: 010-3019-4972<br/>
            • 메일: contact@healingt.online<br/>
            <br/>
            개인정보 관리 담당자<br/>
            • 이름: 김진구<br/>
            • 직위: 대표<br/>
            • 전화: 010-3019-4972<br/>
            • 메일: contact@healingt.online<br/>
            <br/>
            기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.<br/>
            <br/>
            • 개인정보침해신고센터 ( http://privacy.kisa.or.kr / 국번없이 118 )<br/>
            • 대검찰청 사이버수사과 ( http://www.spo.go.kr / 국번없이 1301 )<br/>
            • 경찰청 사이버안전국 ( http://www.ctrc.go.kr / 국번없이 182 )<br/>
            <br/>
            <br/>
            <h3>10. 고지의 의무</h3>
            <br/>
            현 개인정보취급방침 내용 추가, 삭제 및 수정이 있을 시에는 개정 최소 7일전부터 홈페이지의 ‘공지사항’을 통해 고지할
            것입니다.<br/>
            다만, 개인정보의 수집 및 활용, 제3자 제공 등과 같이 이용자 권리의 중요한 변경이 있을 경우에는 최소 30일 전에
            고지합니다.<br/>
            <br/>
            공지일자 : 2021년 01월 25일<br/>
            적용일자 : 2021년 01월 25일<br/>
            <br/>
            <br/>
        </div>
    </>
}

export default Terms